In [6]:
import pandas as pd
df = pd.DataFrame({"names":["vishnu","sreekar","mohan","bharat"],
                 "age":[20,14,31,29]})
print(df)
print()

df1 = pd.DataFrame({"names":["sankar","vani","delhi","sobha"],
                   "age":[53,45,54,48]})
print(df1)

     names  age
0   vishnu   20
1  sreekar   14
2    mohan   31
3   bharat   29

    names  age
0  sankar   53
1    vani   45
2   delhi   54
3   sobha   48

<font size="5">now lets concatenate the two DataFrames using concat method

In [7]:
combine = pd.concat([df,df1])
combine

     names  age
0   vishnu   20
1  sreekar   14
2    mohan   31
3   bharat   29
0   sankar   53
1     vani   45
2    delhi   54
3    sobha   48

<font size="5">we can add sunindexes using key parametr

In [9]:
combine = pd.concat([df,df1],keys=["df","df1"])
combine

         names  age
df  0   vishnu   20
    1  sreekar   14
    2    mohan   31
    3   bharat   29
df1 0   sankar   53
    1     vani   45
    2    delhi   54
    3    sobha   48

<font size="6"><font color="red">if we want to combine col wise we use paramter axis=1

In [10]:
combine = pd.concat([df,df1],axis=1)
combine

     names  age   names  age
0   vishnu   20  sankar   53
1  sreekar   14    vani   45
2    mohan   31   delhi   54
3   bharat   29   sobha   48

In [11]:
combine = pd.concat([df,df1],ignore_index=True)
combine

     names  age
0   vishnu   20
1  sreekar   14
2    mohan   31
3   bharat   29
4   sankar   53
5     vani   45
6    delhi   54
7    sobha   48